Number of words in the vocabulary:
500
Vocabulary:
w-0
w-0001
w-001
w-01
w-02
w-05
w-1
w-10
w-100
w-11
w-12
w-13
w-14
w-15
w-16
w-17
w-18
w-1c
w-2
w-20
w-24
w-25
w-3
w-30
w-4
w-40
w-5
w-50
w-6
w-60
w-7
w-8
w-9
w-95
w-a1c
w-abnorm
w-achiev
w-acid
w-action
w-activ
w-acut
w-addit
w-adjust
w-administr
w-adolesc
w-adult
w-affect
w-age
w-agent
w-aim
w-albumin
w-allel
w-alpha
w-alter
w-american
w-analys
w-analysi
w-ani
w-anim
w-antibodi
w-antigen
w-appear
w-approach
w-approxim
w-area
w-arteri
w-assess
w-associ
w-autoantibodi
w-autoimmun
w-b
w-background
w-basal
w-base
w-baselin
w-bb
w-becaus
w-befor
w-beta
w-betacel
w-bind
w-blood
w-bmi
w-bodi
w-bone
w-c
w-cardiac
w-cardiovascular
w-care
w-case
w-caus
w-cd4
w-cell
w-chang
w-character
w-children
w-cholesterol
w-chromosom
w-chronic
w-ci
w-class
w-clinic
w-cohort
w-combin
w-common
w-compar
w-complet
w-complex
w-complic
w-concentr
w-conclud
w-conclus
w-condit
w-conduct
w-confirm
w-consist
w-content
w-continu
w-contrast
w-contribut
w-control
w-coronari
w-correl
w-cpeptid
w-current
w-cytokin
w-d
w-daili
w-data
w-day
w-db
w-death
w-decreas
w-defect
w-degre
w-demonstr
w-densiti
w-depend
w-depress
w-describ
w-design
w-destruct
w-detect
w-determin
w-develop
w-diagnos
w-diagnosi
w-did
w-diet
w-dietari
w-differ
w-direct
w-diseas
w-disord
w-dl
w-dm
w-dose
w-drug
w-durat
w-dure
w-dysfunct
w-e
w-earli
w-effect
w-elev
w-endotheli
w-enhanc
w-enzym
w-estim
w-evalu
w-event
w-evid
w-examin
w-excret
w-exercis
w-experiment
w-express
w-factor
w-failur
w-famili
w-fast
w-fat
w-fatti
w-femal
w-flow
w-follow
w-followup
w-form
w-free
w-frequenc
w-frequent
w-function
w-g
w-gene
w-general
w-genet
w-genotyp
w-given
w-glomerular
w-glucagon
w-glucos
w-glycaem
w-glycem
w-glycosyl
w-graft
w-greater
w-group
w-growth
w-gt
w-h
w-haplotyp
w-hba
w-hba1c
w-health
w-healthi
w-heart
w-hemoglobin
w-hepat
w-high
w-higher
w-histori
w-hla
w-hormon
w-howev
w-human
w-hyperglycemia
w-hypertens
w-hypoglycaemia
w-hypoglycemia
w-hypothesi
w-ica
w-iddm
w-identifi
w-ii
w-immun
w-impair
w-import
w-improv
w-incid
w-includ
w-increas
w-independ
w-index
w-indic
w-individu
w-induc
w-induct
w-infect
w-influenc
w-infus
w-inhibit
w-inhibitor
w-initi
w-inject
w-insul
w-insulin
w-insulindepend
w-intak
w-intens
w-interact
w-interv
w-intervent
w-investig
w-involv
w-islet
w-isol
w-kg
w-kidney
w-kinas
w-known
w-l
w-larg
w-lead
w-level
w-life
w-like
w-linkag
w-lipid
w-lipoprotein
w-liver
w-locus
w-longterm
w-loss
w-low
w-lower
w-lt
w-lymphocyt
w-m
w-macrophag
w-major
w-male
w-manag
w-mark
w-marker
w-mass
w-meal
w-mean
w-measur
w-mechan
w-mediat
w-medic
w-mellitus
w-membran
w-men
w-metabol
w-metformin
w-method
w-mg
w-mhc
w-mice
w-microalbuminuria
w-min
w-ml
w-mm
w-mmol
w-model
w-molecul
w-month
w-mortal
w-mous
w-mrna
w-multipl
w-muscl
w-mutat
w-myocardi
w-n
w-need
w-negat
w-nephropathi
w-nerv
w-neuropathi
w-new
w-niddm
w-nod
w-nondiabet
w-noninsulindepend
w-nonobes
w-normal
w-number
w-obes
w-object
w-observ
w-obtain
w-occur
w-onli
w-onset
w-oral
w-outcom
w-oxid
w-p
w-pancrea
w-pancreat
w-parent
w-particip
w-particular
w-pathogenesi
w-pathway
w-patient
w-pattern
w-peopl
w-peptid
w-perform
w-period
w-peripher
w-phenotyp
w-physic
w-placebo
w-plasma
w-play
w-polymorph
w-poor
w-popul
w-posit
w-possibl
w-postprandi
w-potenti
w-predict
w-presenc
w-present
w-pressur
w-preval
w-prevent
w-previous
w-primari
w-process
w-produc
w-product
w-profil
w-progress
w-promot
w-protect
w-protein
w-provid
w-r
w-random
w-rang
w-rat
w-rate
w-ratio
w-receiv
w-recent
w-receptor
w-recipi
w-reduc
w-reduct
w-region
w-regul
w-relat
w-relationship
w-releas
w-remain
w-renal
w-report
w-requir
w-research
w-resist
w-respect
w-respons
w-result
w-retin
w-retinopathi
w-reveal
w-revers
w-review
w-risk
w-role
w-s
w-sampl
w-score
w-screen
w-secret
w-seen
w-select
w-sensit
w-serum
w-sever
w-sex
w-shown
w-signific
w-similar
w-singl
w-small
w-specif
w-spontan
w-standard
w-state
w-status
w-stimul
w-streptozotocin
w-stress
w-strong
w-studi
w-stz
w-subject
w-suggest
w-support
w-suppress
w-suscept
w-symptom
w-syndrom
w-synthesi
w-t
w-t1d
w-t2dm
w-target
w-tcell
w-test
w-therapi
w-therefor
w-time
w-tissu
w-toler
w-total
w-transgen
w-transplant
w-transport
w-treat
w-treatment
w-trial
w-triglycerid
w-type
w-uptak
w-urinari
w-use
w-v
w-valu
w-variabl
w-variant
w-vascular
w-versus
w-vitro
w-vivo
w-vs
w-week
w-weight
w-wherea
w-women
w-x
w-year
w-young
